Revit 2027 API
BuiltInFailures.FamilyFailures.TypeRecursiveElementIdParameter Property
 Type's parameter cannot recursively point to the type itself.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TypeRecursiveElementIdParameter { get; }
Public Shared ReadOnly Property TypeRecursiveElementIdParameter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TypeRecursiveElementIdParameter {
	FailureDefinitionId^ get ();
}
static member TypeRecursiveElementIdParameter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace